
/*~~~~~~~~~~~~~~~~~~~~~~~~【while 循环】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int a = 10;
//
//   /* while 循环执行 */
//   while( a < 20 )
//   {
//      printf("a 的值： %d\n", a);
//      a++;
//   }
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【for 循环】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main ()
//{
//   /* for 循环执行 */
//   for( int a = 10; a < 20; a = a + 1 )
//   {
//      printf("a 的值： %d\n", a);
//   }
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【do...while 循环】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int a = 10;
//
//   /* do 循环执行，在条件被测试之前至少执行一次 */
//   do
//   {
//       printf("a 的值： %d\n", a);
//       a = a + 1;
//   }while( a < 20 );
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【嵌套循环】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int i, j;
//   
//   for(i=2; i<100; i++) {
//      for(j=2; j <= (i/j); j++)
//        if(!(i%j)) break; // 如果找到，则不是质数
//      if(j > (i/j)) printf("%d 是质数\n", i);
//   }
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【while 嵌套实例】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
//int main()
//{
//    int i=1,j;
//    while (i <= 5)
//    {
//        j=1;
//        while (j <= i )
//        {
//            printf("%d ",j);
//            j++;
//        }
//        printf("\n");
//        i++;
//    }
//    return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【do-while 嵌套实例】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
//int main()
//{
//    int i=1,j;
//    do
//    {
//        j=1;
//        do
//        {
//            printf("*");
//            j++;
//        }while(j <= i);
//        i++;
//        printf("\n");
//    }while(i <= 5);
//    return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/



