
/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【在程序中使用该常量时，编译器会将所有的 PI 替换为 3.14159。】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//#define LENGTH 10   
//#define WIDTH  5
//#define NEWLINE '\n'
// 
//int main()
//{
// 
//   int area;  
//  
//   area = LENGTH * WIDTH;
//   printf("value of area : %d", area);
//   printf("%c", NEWLINE);
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【const 关键字】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main()
//{
//   const int  LENGTH = 10;
//   const int  WIDTH  = 5;
//   const char NEWLINE = '\n';
//   int area;  
//   
//   area = LENGTH * WIDTH;
//   printf("value of area : %d", area);
//   printf("%c", NEWLINE);
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#define 与 const 区别
//#define 与 const 这两种方式都可以用来定义常量，选择哪种方式取决于具体的需求和编程习惯。通常情况下，建议使用 const 关键字来定义常量，因为它具有类型检查和作用域的优势，而 #define 仅进行简单的文本替换，可能会导致一些意外的问题。
//
//#define 预处理指令和 const 关键字在定义常量时有一些区别：
//
//替换机制：#define 是进行简单的文本替换，而 const 是声明一个具有类型的常量。#define 定义的常量在编译时会被直接替换为其对应的值，而 const 定义的常量在程序运行时会分配内存，并且具有类型信息。
//
//类型检查：#define 不进行类型检查，因为它只是进行简单的文本替换。而 const 定义的常量具有类型信息，编译器可以对其进行类型检查。这可以帮助捕获一些潜在的类型错误。
//
//作用域：#define 定义的常量没有作用域限制，它在定义之后的整个代码中都有效。而 const 定义的常量具有块级作用域，只在其定义所在的作用域内有效。
//
//调试和符号表：使用 #define 定义的常量在符号表中不会有相应的条目，因为它只是进行文本替换。而使用 const 定义的常量会在符号表中有相应的条目，有助于调试和可读性。

/*~~~~~~~~~~~~~~~~~~~~~~~~【字符常量】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//字符常量是括在单引号中，例如，'x' 可以存储在 char 类型的简单变量中。
//
//字符常量可以是一个普通的字符（例如 'x'）、一个转义序列（例如 '\t'），或一个通用的字符（例如 '\u02C0'）。
//
//在 C 中，有一些特定的字符，当它们前面有反斜杠时，它们就具有特殊的含义，被用来表示如换行符（\n）或制表符（\t）等。下表列出了一些这样的转义序列码：
//
//转义序列	含义
//\\	\ 字符
//\'	' 字符
//\"	" 字符
//\?	? 字符
//\a	警报铃声
//\b	退格键
//\f	换页符
//\n	换行符
//\r	回车
//\t	水平制表符
//\v	垂直制表符
//\ooo	一到三位的八进制数
//\xhh . . .	一个或多个数字的十六进制数


/*~~~~~~~~~~~~~~~~~~~~~~~~【字符常量】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int main()
//{
//   printf("Hello\tWorld\n\n");
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【定义常量】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//#define LENGTH 10   
//#define WIDTH  5
//#define NEWLINE '\n'
// 
//int main()
//{
// 
//   int area;  
//  
//   area = LENGTH * WIDTH;
//   printf("value of area : %d", area);
//   printf("%c", NEWLINE);
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/



