
/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【存储类】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//存储类定义 C 程序中变量/函数的存储位置、生命周期和作用域。
//
//这些说明符放置在它们所修饰的类型之前。
//
//下面列出 C 程序中可用的存储类：
//
//auto
//register
//static
//extern

/*~~~~~~~~~~~~~~~~~~~~~~~~【 static 修饰全局变量和局部变量的应用：】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
///* 函数声明 */
//void func1(void);
// 
//static int count=10;        /* 全局变量 - static 是默认的 */
// 
//int main()
//{
//  while (count--) {
//      func1();
//  }
//  return 0;
//}
// 
//void func1(void)
//{
///* 'thingy' 是 'func1' 的局部变量 - 只初始化一次
// * 每次调用函数 'func1' 'thingy' 值不会被重置。
// */                
//  static int thingy=5;
//  thingy++;
//  printf(" thingy 为 %d ， count 为 %d\n", thingy, count);
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【extern 修饰符通常用于当有两个或多个文件共享相同的全局变量或函数】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//int count ;
//extern void write_extern();
// 
//int main()
//{
//   count = 5;
//   write_extern();
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
//extern int count;
// 
//void write_extern(void)
//{
//   printf("count is %d\n", count);
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/



