
/*~~~~~~~~~~~~~~~~~~~~~~~~【函数声明】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
///* 函数声明 */
//int max(int num1, int num2);
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int a = 100;
//   int b = 200;
//   int ret;
// 
//   /* 调用函数来获取最大值 */
//   ret = max(a, b);
// 
//   printf( "Max value is : %d\n", ret );
// 
//   return 0;
//}
// 
///* 函数返回两个数中较大的那个数 */
//int max(int num1, int num2) 
//{
//   /* 局部变量声明 */
//   int result;
// 
//   if (num1 > num2)
//      result = num1;
//   else
//      result = num2;
// 
//   return result; 
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【传值方式调用函数!!】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
///* 函数声明 */
//void swap(int x, int y);
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int a = 100;
//   int b = 200;
// 
//   printf("交换前，a 的值： %d\n", a );
//   printf("交换前，b 的值： %d\n", b );
// 
//   /* 调用函数来交换值 */
//   swap(a, b);
// 
//   printf("交换后，a 的值： %d\n", a );
//   printf("交换后，b 的值： %d\n", b );
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【引用方式调用函数!!】~~~~~~~~~~~~~~~~~~~~~~~~~*/
//#include <stdio.h>
// 
///* 函数声明 */
//void swap(int *x, int *y);
// 
//int main ()
//{
//   /* 局部变量定义 */
//   int a = 100;
//   int b = 200;
// 
//   printf("交换前，a 的值： %d\n", a );
//   printf("交换前，b 的值： %d\n", b );
// 
//   /* 调用函数来交换值
//    * &a 表示指向 a 的指针，即变量 a 的地址 
//    * &b 表示指向 b 的指针，即变量 b 的地址 
//   */
//   swap(&a, &b);
// 
//   printf("交换后，a 的值： %d\n", a );
//   printf("交换后，b 的值： %d\n", b );
// 
//   return 0;
//}

/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/


/*~~~~~~~~~~~~~~~~~~~~~~~~【】~~~~~~~~~~~~~~~~~~~~~~~~~*/



